" Включаем несовместимость настроек с предшественником Vi
set nocompatible
" Включаем подсветку синтаксиса
syntax on
" Включаем отображение выполняемой в данный момент команды в правом нижнем углу экрана
set showcmd
" Показывать первую парную скобку после ввода второй
set showmatch
" Показывать строку статуса всегда
set laststatus=2
" Показывать имя буфера в заголовке терминала
set title
" Формат заголовка
set titlestring=%t%(\ %m%)%(\ %r%)%(\ %h%)%(\ %w%)%(\ (%{expand(\"%:p:~:h\")})%)\ -\ VIM
" Включаем отображение дополнительной информации в статусной строке
set statusline=%<%f%h%m%r%=format=%{&fileformat}\ file=%{&fileencoding}\ enc=%{&encoding}\ %b\ 0x%B\ %l,%c%V\ %P
" Использовать больше цветов в терминале
set t_Co=256
" Включает отображение номеров строк
" set number
" Включаем ‘умную’ автоматическую расстановку отступов
" set smartindent
" Копирует отступ от предыдущей строки » наследовать отступы предыдущей строки
" set autoindent
" Размер табуляции
set tabstop=4
" Включить подсветку невидимых символов
" set list
" Показывать строку с позицией курсора
set ruler
" Опции авто-дополнения
set completeopt=longest,menuone
" Включаем подсветку выражения, которое ищется в тексте
set hlsearch

filetype plugin indent on

